@ketzacoatl I tested with the example/examples/vpc-scenario-2 and a similar environment but with an Application environment here are the outputs 

### VPC Scenario 2 with ELB
```
examples/vpc-scenario-2 $ make plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.init-warp-hello-world.data.template_file.init_snippet: Refreshing state...
module.init-simple-hostname.data.template_file.init_snippet: Refreshing state...
module.vpc.module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0a4b89ef6b83bb400]
module.vpc.module.nat-gateway.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0c079060ed4ec7110]
module.ubuntu-xenial-ami.data.aws_partition.current: Refreshing state...
module.vpc.module.nat-gateway.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0fc5c0cdbe600acfb]
data.aws_availability_zones.available: Refreshing state...
module.vpc.module.nat-gateway.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fa005af8be77853b]
module.ubuntu-xenial-ami.data.aws_ami.ubuntu: Refreshing state...
module.vpc.module.public-gateway.aws_internet_gateway.public: Refreshing state... [id=igw-08aa854e9db278cce]
module.vpc.module.public-gateway.aws_route_table.public: Refreshing state... [id=rtb-0c91bf1314f4fddaa]
module.vpc.module.public-subnets.aws_subnet.main[1]: Refreshing state... [id=subnet-04d533bed09daef07]
module.vpc.module.public-subnets.aws_subnet.main[0]: Refreshing state... [id=subnet-077990ec50af4ae88]
module.vpc.module.public-subnets.aws_subnet.main[2]: Refreshing state... [id=subnet-0420eb802719134f7]
module.vpc.module.private-subnets.aws_subnet.main[1]: Refreshing state... [id=subnet-0979241e631726c47]
module.vpc.module.private-subnets.aws_subnet.main[0]: Refreshing state... [id=subnet-0cab8abfcdc05d375]
module.vpc.module.private-subnets.aws_subnet.main[2]: Refreshing state... [id=subnet-093ca09751a4ace99]
module.vpc.module.public-gateway.aws_route.public: Refreshing state... [id=r-rtb-0c91bf1314f4fddaa1080289494]
module.vpc.module.public-gateway.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01b215f41fe1da4cd]
module.vpc.module.public-gateway.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bbb9534b3f562eaf]
module.vpc.module.nat-gateway.data.aws_subnet.public[2]: Refreshing state...
module.vpc.module.nat-gateway.data.aws_subnet.public[0]: Refreshing state...
module.vpc.module.public-gateway.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-084d196496bd58a95]
module.vpc.module.nat-gateway.data.aws_subnet.public[1]: Refreshing state...
module.vpc.module.nat-gateway.aws_nat_gateway.nat[1]: Refreshing state... [id=nat-051d222d01512976d]
module.vpc.module.nat-gateway.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-0754229b5bd617299]
module.vpc.module.nat-gateway.aws_nat_gateway.nat[2]: Refreshing state... [id=nat-01035a77bedfa822f]
module.vpc.module.nat-gateway.aws_route_table.private[1]: Refreshing state... [id=rtb-0a8e07c003a768ba1]
module.vpc.module.nat-gateway.aws_route_table.private[2]: Refreshing state... [id=rtb-0e3a2b6fb6ec72f65]
module.vpc.module.nat-gateway.aws_route_table.private[0]: Refreshing state... [id=rtb-04e6d15f377a639be]
module.vpc.module.nat-gateway.aws_route_table_association.private-rta[1]: Refreshing state... [id=rtbassoc-0b254aecbc7579787]
module.vpc.module.nat-gateway.aws_route_table_association.private-rta[0]: Refreshing state... [id=rtbassoc-02e201a9146fa1bf0]
module.vpc.module.nat-gateway.aws_route_table_association.private-rta[2]: Refreshing state... [id=rtbassoc-08bdd235a9a774b71]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.bastion will be created
  + resource "aws_eip" "bastion" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + vpc               = true
    }

  # aws_eip_association.bastion will be created
  + resource "aws_eip_association" "bastion" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_elb.web will be created
  + resource "aws_elb" "web" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = false
      + name                        = "test-project-public-elb"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-0420eb802719134f7",
          + "subnet-04d533bed09daef07",
          + "subnet-077990ec50af4ae88",
        ]
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 15
          + target              = "TCP:3000"
          + timeout             = 5
          + unhealthy_threshold = 10
        }

      + listener {
          + instance_port     = 3000
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                          = "ami-07b4f3c02c7f83d59"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.nano"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "test-project"
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-077990ec50af4ae88"
      + tenancy                      = (known after apply)
      + user_data                    = "36083a7dca6a77bbc37e93fc9c2a2eb5cf26268e"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + iops                  = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp2"
        }
    }

  # aws_key_pair.main will be created
  + resource "aws_key_pair" "main" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "test-project"
      + public_key  = "xxxx"
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-project-bastion"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0a4b89ef6b83bb400"
    }

  # module.bastion-egress-rule.aws_security_group_rule.open_egress will be created
  + resource "aws_security_group_rule" "open_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "OPEN egress, all ports, all protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.bastion-ssh-rule.aws_security_group_rule.ssh_tcp will be created
  + resource "aws_security_group_rule" "ssh_tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ingress, SSH server port  22 (TCP)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.elb-http-rule.aws_security_group_rule.tcp-ingress[0] will be created
  + resource "aws_security_group_rule" "tcp-ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "open HTTP on the ELB to public access (tcp)"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.elb-open-egress-rule.aws_security_group_rule.open_egress will be created
  + resource "aws_security_group_rule" "open_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "OPEN egress, all ports, all protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.elb-sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Allow public access to ELB in test-project"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-project-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-project-elb"
        }
      + vpc_id                 = "vpc-0a4b89ef6b83bb400"
    }

  # module.web.aws_autoscaling_group.cluster will be created
  + resource "aws_autoscaling_group" "cluster" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = true
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "test-project-public-elb",
        ]
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = (known after apply)
      + name_prefix               = "test-project-web-cluster"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "test-project-web-cluster"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-093ca09751a4ace99",
          + "subnet-0979241e631726c47",
          + "subnet-0cab8abfcdc05d375",
        ]
      + wait_for_capacity_timeout = "10m"
    }

  # module.web.aws_launch_configuration.cluster will be created
  + resource "aws_launch_configuration" "cluster" {
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-07b4f3c02c7f83d59"
      + instance_type               = "t2.nano"
      + key_name                    = "test-project"
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "9214e8a4198dbb428d9aadd718f4b6af22672979"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + iops                  = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp2"
        }
    }

  # module.web-http-elb-sg-rule.aws_security_group_rule.tcp-ingress[0] will be created
  + resource "aws_security_group_rule" "tcp-ingress" {
      + cidr_blocks              = [
          + "10.23.11.0/24",
          + "10.23.12.0/24",
          + "10.23.13.0/24",
        ]
      + description              = "Allow ELB HTTP to web app on port 3000 (tcp)"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # module.web-open-egress-sg-rule.aws_security_group_rule.open_egress will be created
  + resource "aws_security_group_rule" "open_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "OPEN egress, all ports, all protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.web-sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and SSH to web instance in test-project"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "test-project-web"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-project-web"
        }
      + vpc_id                 = "vpc-0a4b89ef6b83bb400"
    }

  # module.web-ssh-rule.aws_security_group_rule.ssh_tcp will be created
  + resource "aws_security_group_rule" "ssh_tcp" {
      + cidr_blocks              = [
          + "10.23.11.0/24",
          + "10.23.12.0/24",
          + "10.23.13.0/24",
        ]
      + description              = "Allow ingress, SSH server port  22 (TCP)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc.module.vpc.aws_vpc_dhcp_options.main will be created
  + resource "aws_vpc_dhcp_options" "main" {
      + domain_name         = "us-west-2.compute.internal"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + ntp_servers         = []
      + owner_id            = (known after apply)
      + tags                = {
          + "Name" = "test-project"
          + "kali" = "ma"
        }
    }

  # module.vpc.module.vpc.aws_vpc_dhcp_options_association.main will be created
  + resource "aws_vpc_dhcp_options_association" "main" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = "vpc-0a4b89ef6b83bb400"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```
```
examples/vpc-scenario-2$ make apply
....
module.elb-open-egress-rule.aws_security_group_rule.open_egress: Creation complete after 3s [id=sgrule-2495216589]
module.bastion-ssh-rule.aws_security_group_rule.ssh_tcp: Creation complete after 6s [id=sgrule-1553267383]
module.web.aws_launch_configuration.cluster: Creation complete after 5s [id=terraform-20190723193459915700000001]
module.web-open-egress-sg-rule.aws_security_group_rule.open_egress: Creation complete after 6s [id=sgrule-351834035]
module.elb-http-rule.aws_security_group_rule.tcp-ingress[0]: Creation complete after 6s [id=sgrule-1700445075]
module.web-http-elb-sg-rule.aws_security_group_rule.tcp-ingress[0]: Creation complete after 9s [id=sgrule-2397055992]
aws_instance.bastion: Still creating... [10s elapsed]
aws_elb.web: Still creating... [10s elapsed]
aws_elb.web: Creation complete after 17s [id=test-project-public-elb]
module.web.aws_autoscaling_group.cluster: Creating...
aws_instance.bastion: Still creating... [20s elapsed]
aws_instance.bastion: Creation complete after 27s [id=i-0924961442283fdf9]
aws_eip_association.bastion: Creating...
module.web.aws_autoscaling_group.cluster: Still creating... [10s elapsed]
aws_eip_association.bastion: Creation complete after 2s [id=eipassoc-00bf3f412c446de14]
module.web.aws_autoscaling_group.cluster: Still creating... [20s elapsed]
module.web.aws_autoscaling_group.cluster: Still creating... [30s elapsed]
module.web.aws_autoscaling_group.cluster: Still creating... [40s elapsed]
module.web.aws_autoscaling_group.cluster: Still creating... [51s elapsed]
module.web.aws_autoscaling_group.cluster: Creation complete after 53s [id=test-project-web-cluster20190723193515478600000002]

Apply complete! Resources: 19 added, 0 changed, 0 destroyed.

The state of your infrastructure has been saved to the path
below. This state is required to modify and destroy your
infrastructure, so keep it safe. To inspect the complete state
use the `terraform show` command.

State path: terraform.tfstate

Outputs:

asg_name = test-project-web-cluster20190723193515478600000002
bastion_eip = 54.148.71.37
elb_dns = test-project-public-elb-2099247298.us-west-2.elb.amazonaws.com
region = us-west-2
```
```
examples/vpc-scenario-2 $ make test
*   Trying 34.216.213.165...
* TCP_NODELAY set
* Connected to test-project-public-elb-2099247298.us-west-2.elb.amazonaws.com (34.216.213.165) port 80 (#0)
> GET / HTTP/1.1
> Host: test-project-public-elb-2099247298.us-west-2.elb.amazonaws.com
> User-Agent: curl/7.54.0
> Accept: */*
>
< HTTP/1.1 200 OK
< Content-Type: text/html; charset=utf-8
< Date: Tue, 23 Jul 2019 19:38:35 GMT
< Server: Warp/3.2.9
< Content-Length: 1090
< Connection: keep-alive
<
<html><head><title>root folder</title><style>table { margin: 0 auto; width: 760px; border-collapse: collapse; font-family: 'sans-serif'; }
table, th, td { border: 1px solid #353948; }
td.size { text-align: right; font-size: 0.7em; width: 50px }
td.date { text-align: right; font-size: 0.7em; width: 130px }
td { padding-right: 1em; padding-left: 1em; }
th.first { background-color: white; width: 24px }
td.first { padding-right: 0; padding-left: 0; text-align: center }
tr { background-color: white; }
tr.alt { background-color: #A3B5BA}
th { background-color: #3C4569; color: white; font-size: 1.125em; }
h1 { width: 760px; margin: 1em auto; font-size: 1em; font-family: sans-serif }
img { width: 20px }
a { text-decoration: none }
* Connection #0 to host test-project-public-elb-2099247298.us-west-2.elb.amazonaws.com left intact
</style></head><body><h1>root</h1><table><thead><th class="first"><img src=".hidden/haskell.png"></th><th>Name</th><th>Modified</th><th>Size</th></thead><tbody><tr><td class="first"></td><td><a href="cloud-init-output.log">cloud-init-output.log</a></td><td class="date">23-Jul-2019 19:36:45</td><td class="size">13 KB</td></tr></tbody></table></body></html>% 
```




### VPC scenario 2 with ALB 
This PR contains scenario 2 and ALB
```
examples/vpc-scenario-2-alb $ make plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.init-simple-hostname.data.template_file.init_snippet: Refreshing state...
module.init-warp-hello-world.data.template_file.init_snippet: Refreshing state...
data.aws_availability_zones.available: Refreshing state...
module.vpc.module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0de179bd4400ce258]
module.vpc.module.nat-gateway.aws_eip.nat[2]: Refreshing state... [id=eipalloc-06e42a5e0948a58f6]
module.vpc.module.nat-gateway.aws_eip.nat[1]: Refreshing state... [id=eipalloc-063644f6a90b75e12]
module.ubuntu-xenial-ami.data.aws_partition.current: Refreshing state...
module.vpc.module.nat-gateway.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d493f7626aff2274]
module.ubuntu-xenial-ami.data.aws_ami.ubuntu: Refreshing state...
module.vpc.module.public-subnets.aws_subnet.main[1]: Refreshing state... [id=subnet-032df3acb815105f1]
module.vpc.module.public-subnets.aws_subnet.main[0]: Refreshing state... [id=subnet-07bd3e58db3b4020a]
module.vpc.module.public-subnets.aws_subnet.main[2]: Refreshing state... [id=subnet-029d66557d1f133c2]
module.vpc.module.public-gateway.aws_route_table.public: Refreshing state... [id=rtb-044788e5d58881e63]
module.vpc.module.public-gateway.aws_internet_gateway.public: Refreshing state... [id=igw-01c9141c3a8eed782]
module.vpc.module.private-subnets.aws_subnet.main[0]: Refreshing state... [id=subnet-094f1ba5f56cc9996]
module.vpc.module.private-subnets.aws_subnet.main[1]: Refreshing state... [id=subnet-0acc87adac6018955]
module.vpc.module.private-subnets.aws_subnet.main[2]: Refreshing state... [id=subnet-0743dc7edeca2263a]
module.vpc.module.public-gateway.aws_route.public: Refreshing state... [id=r-rtb-044788e5d58881e631080289494]
module.vpc.module.public-gateway.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bf09f68f157a348d]
module.vpc.module.public-gateway.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00319238d1b89b38b]
module.vpc.module.public-gateway.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-029c6030ddfde1452]
module.vpc.module.nat-gateway.data.aws_subnet.public[0]: Refreshing state...
module.vpc.module.nat-gateway.data.aws_subnet.public[1]: Refreshing state...
module.vpc.module.nat-gateway.data.aws_subnet.public[2]: Refreshing state...
module.vpc.module.nat-gateway.aws_nat_gateway.nat[1]: Refreshing state... [id=nat-018c06ac5a6fd3cfc]
module.vpc.module.nat-gateway.aws_nat_gateway.nat[2]: Refreshing state... [id=nat-0ddce12486b115dba]
module.vpc.module.nat-gateway.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-0ce6dd758f9ba5ab1]
module.vpc.module.nat-gateway.aws_route_table.private[2]: Refreshing state... [id=rtb-060e85cf431127d3f]
module.vpc.module.nat-gateway.aws_route_table.private[1]: Refreshing state... [id=rtb-0e8c3027dc2222049]
module.vpc.module.nat-gateway.aws_route_table.private[0]: Refreshing state... [id=rtb-0ef9914062395b16d]
module.vpc.module.nat-gateway.aws_route_table_association.private-rta[2]: Refreshing state... [id=rtbassoc-0200a67be49707421]
module.vpc.module.nat-gateway.aws_route_table_association.private-rta[1]: Refreshing state... [id=rtbassoc-0128525446b0e6d85]
module.vpc.module.nat-gateway.aws_route_table_association.private-rta[0]: Refreshing state... [id=rtbassoc-06595cd73bc33eb47]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.bastion will be created
  + resource "aws_eip" "bastion" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + vpc               = true
    }

  # aws_eip_association.bastion will be created
  + resource "aws_eip_association" "bastion" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                          = "ami-01e6a0b85de033c99"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.nano"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "pm-vpc-2-alb"
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-07bd3e58db3b4020a"
      + tenancy                      = (known after apply)
      + user_data                    = "36083a7dca6a77bbc37e93fc9c2a2eb5cf26268e"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + iops                  = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp2"
        }
    }

  # aws_key_pair.main will be created
  + resource "aws_key_pair" "main" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "pm-vpc-2-alb"
      + public_key  = "xxxxxx"
    }

  # aws_lb.web will be created
  + resource "aws_lb" "web" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 300
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "pm-vpc-2-alb-alb"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-029d66557d1f133c2",
          + "subnet-032df3acb815105f1",
          + "subnet-07bd3e58db3b4020a",
        ]
      + tags                       = {
          + "Name" = "pm-vpc-2-alb-alb"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # aws_lb_listener.external-http will be created
  + resource "aws_lb_listener" "external-http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + name                               = (known after apply)
      + port                               = 3000
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "pm-vpc-2-alb-alb-tg"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0de179bd4400ce258"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "pm-vpc-2-alb-bastion"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0de179bd4400ce258"
    }

  # module.alb-http-rule.aws_security_group_rule.tcp-ingress[0] will be created
  + resource "aws_security_group_rule" "tcp-ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "open HTTP on the ALB to public access (tcp)"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb-open-egress-rule.aws_security_group_rule.open_egress will be created
  + resource "aws_security_group_rule" "open_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "OPEN egress, all ports, all protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.alb-sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Allow public access to ALB in pm-vpc-2-alb"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "pm-vpc-2-alb-alb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "pm-vpc-2-alb-alb"
        }
      + vpc_id                 = "vpc-0de179bd4400ce258"
    }

  # module.bastion-egress-rule.aws_security_group_rule.open_egress will be created
  + resource "aws_security_group_rule" "open_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "OPEN egress, all ports, all protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.bastion-ssh-rule.aws_security_group_rule.ssh_tcp will be created
  + resource "aws_security_group_rule" "ssh_tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ingress, SSH server port  22 (TCP)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.web.aws_autoscaling_group.cluster will be created
  + resource "aws_autoscaling_group" "cluster" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = true
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = (known after apply)
      + name_prefix               = "pm-vpc-2-alb-web-cluster"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "pm-vpc-2-alb-web-cluster"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-0743dc7edeca2263a",
          + "subnet-094f1ba5f56cc9996",
          + "subnet-0acc87adac6018955",
        ]
      + wait_for_capacity_timeout = "10m"
    }

  # module.web.aws_launch_configuration.cluster will be created
  + resource "aws_launch_configuration" "cluster" {
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-01e6a0b85de033c99"
      + instance_type               = "t2.nano"
      + key_name                    = "pm-vpc-2-alb"
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "9214e8a4198dbb428d9aadd718f4b6af22672979"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + iops                  = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp2"
        }
    }

  # module.web-http-elb-sg-rule.aws_security_group_rule.tcp-ingress[0] will be created
  + resource "aws_security_group_rule" "tcp-ingress" {
      + cidr_blocks              = [
          + "10.23.11.0/24",
          + "10.23.12.0/24",
          + "10.23.13.0/24",
        ]
      + description              = "Allow ELB HTTP to web app on port 3000 (tcp)"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # module.web-open-egress-sg-rule.aws_security_group_rule.open_egress will be created
  + resource "aws_security_group_rule" "open_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "OPEN egress, all ports, all protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.web-sg.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and SSH to web instance in pm-vpc-2-alb"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "pm-vpc-2-alb-web"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "pm-vpc-2-alb-web"
        }
      + vpc_id                 = "vpc-0de179bd4400ce258"
    }

  # module.web-ssh-rule.aws_security_group_rule.ssh_tcp will be created
  + resource "aws_security_group_rule" "ssh_tcp" {
      + cidr_blocks              = [
          + "10.23.11.0/24",
          + "10.23.12.0/24",
          + "10.23.13.0/24",
        ]
      + description              = "Allow ingress, SSH server port  22 (TCP)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc.module.vpc.aws_vpc_dhcp_options.main will be created
  + resource "aws_vpc_dhcp_options" "main" {
      + domain_name         = "eu-west-1.compute.internal"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + ntp_servers         = []
      + owner_id            = (known after apply)
      + tags                = {
          + "Name" = "pm-vpc-2-alb"
          + "kali" = "ma"
        }
    }

  # module.vpc.module.vpc.aws_vpc_dhcp_options_association.main will be created
  + resource "aws_vpc_dhcp_options_association" "main" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = "vpc-0de179bd4400ce258"
    }

Plan: 21 to add, 0 to change, 0 to destroy.
```

```
terraform-aws-foundation/examples/vpc-scenario-2-alb $ make apply
...
aws_lb.web: Still creating... [4m0s elapsed] 
aws_lb.web: Creation complete after 4m6s [id=arn:aws:elasticloadbalancing:eu-west-1:793514493597:loadbalancer/app/pm-vpc-2-alb-alb/2e0d296d894aaeb3]
aws_lb_listener.external-http: Creating...
aws_lb_listener.external-http: Creation complete after 2s [id=arn:aws:elasticloadbalancing:eu-west-1:793514493597:listener/app/pm-vpc-2-alb-alb/2e0d296d894aaeb3/7120025932db13cd]
Apply complete! Resources: 21 added, 0 changed, 0 destroyed.                
The state of your infrastructure has been saved to the path below. This state is required to modify and destroy your infrastructure, so keep it safe. To inspect the complete state use the `terraform show` command.                       
State path: terraform.tfstate
                                                                                                                                               
Outputs:
                                                                                                                                               
alb_dns = pm-vpc-2-alb-alb-1944615780.eu-west-1.elb.amazonaws.com
asg_name = pm-vpc-2-alb-web-cluster20190723190636070700000003
bastion_eip = 63.34.78.90     
region = eu-west-1
```
```
terraform-aws-foundation/examples/vpc-scenario-2-alb $ make test                     
*   Trying 52.50.14.46...
* TCP_NODELAY set
* Connected to pm-vpc-2-alb-alb-1944615780.eu-west-1.elb.amazonaws.com (52.50.14.46) port 80 (#0)                                             
> GET / HTTP/1.1
> Host: pm-vpc-2-alb-alb-1944615780.eu-west-1.elb.amazonaws.com
> User-Agent: curl/7.54.0
> Accept: */*
>
< HTTP/1.1 200 OK
< Date: Tue, 23 Jul 2019 19:11:42 GMT
< Content-Type: text/html; charset=utf-8
< Transfer-Encoding: chunked
< Connection: keep-alive
< Server: Warp/3.2.9
<
<html><head><title>root folder</title><style>table { margin: 0 auto; width: 760px; border-collapse: collapse; font-family: 'sans-serif'; }    
table, th, td { border: 1px solid #353948; }
td.size { text-align: right; font-size: 0.7em; width: 50px }
td.date { text-align: right; font-size: 0.7em; width: 130px }
td { padding-right: 1em; padding-left: 1em; }
th.first { background-color: white; width: 24px }
td.first { padding-right: 0; padding-left: 0; text-align: center }
tr { background-color: white; }
tr.alt { background-color: #A3B5BA}
th { background-color: #3C4569; color: white; font-size: 1.125em; }
h1 { width: 760px; margin: 1em auto; font-size: 1em; font-family: sans-serif }                                                                
img { width: 20px }
a { text-decoration: none }
* Connection #0 to host pm-vpc-2-alb-alb-1944615780.eu-west-1.elb.amazonaws.com left intact                                                   
</style></head><body><h1>root</h1><table><thead><th class="first"><img src=".hidden/haskell.png"></th><th>Name</th><th>Modified</th><th>Size</th></thead><tbody><tr><td class="first"></td><td><a href="cloud-init-output.log">cloud-init-output.log</a></td><td class="date">23-Jul-2019 19:08:14</td><td class="size">13 KB</td></tr></tbody></table></body></html>%     

````